## **Data frame**
Data frame is very usefull data structure when working on data analytics in python. Recently I worked on Face recognition project to identify similar faces from set of images. I used lot of operatins on Data frame. Sharing all the operations I used on Data frame

**1. Create a new data frame**

In [1]:
import pandas as pd
df = pd.DataFrame(columns=['name', 'age', 'city'])

In [2]:
print(df)

Empty DataFrame
Columns: [name, age, city]
Index: []

**2. Create a new data frame from list**

In [3]:
data_list = []
data_list.append({'name':'Chandu', 'age':40, 'city':'Singapore'})
data_list.append({'name':'Richy', 'age':7, 'city':'Singapore'})
data_list.append({'name':'Chandu', 'age':40, 'city':'Singapore'})
data_list.append({'name':'Ricky', 'age':10, 'city':'Singapore'})

In [4]:
# Need to specify column names 
data_df = pd.DataFrame(data_list, columns=['name', 'age', 'city'])

In [5]:
print(data_df)

     name  age       city
0  Chandu   40  Singapore
1   Richy    7  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore

**3. Length of the data frame**

In [6]:
print(len(data_df))

4

**4. Sorting data frame basing on specific column**

In [7]:
data_df.sort_values(by='age')

     name  age       city
1   Richy    7  Singapore
3   Ricky   10  Singapore
0  Chandu   40  Singapore
2  Chandu   40  Singapore

**4.1 Sorting data frame in reverse order(descending)**

In [8]:
# passsing ascending value 'false' makes sorting in reverse order
data_df.sort_values(by='age', ascending=False)

     name  age       city
0  Chandu   40  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore
1   Richy    7  Singapore

**5. Extract a value from data frame**: Accee the value from data frame in two ways:<br>
1. Basing on index
2. Basing on Key

In [9]:
# Accessing value basing on index
print(data_df.iloc[1,0])

Richy

In [10]:
#Accessing value basing on Key
print(data_df.iloc[1]['name'])

Richy

**6. Iterate through Data frame**: using For loop, it is possible to iterate data frame. index is as name says index of the current row, row has all the columns for the current row. Access column values with column id as shown in the below example

In [11]:
for index, row in data_df.iterrows():
    print("{} {} {} {}".format(index, row['name'], row['age'], row['city']))

0 Chandu 40 Singapore
1 Richy 7 Singapore
2 Chandu 40 Singapore
3 Ricky 10 Singapore

**7. Filter/Retrieve data frame basing on column value:**

In [12]:
data_df.loc[data_df['name'] == 'Chandu']

     name  age       city
0  Chandu   40  Singapore
2  Chandu   40  Singapore

In [13]:
age_df = data_df.loc[data_df['age'] > 9]
print(age_df)

     name  age       city
0  Chandu   40  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore

**8. Extract some columns from data frame:** Creating a new data frame with some columns from data frame. In the below example, taking only name and age columns to create a new data frame name_age_df

In [14]:
name_age_df = pd.DataFrame(data_df, columns=['name', 'age'])
print(name_age_df)

     name  age
0  Chandu   40
1   Richy    7
2  Chandu   40
3   Ricky   10

**9. Reading a column values as list from data frame**

In [15]:
name_list = data_df['name'].tolist()
print(name_list)

['Chandu', 'Richy', 'Chandu', 'Ricky']

**9.1 Reading unique values as list from a specific column:** First read column values as a list and then get the unique values from list

In [16]:
# Unique values from list
list(set(name_list))

['Richy', 'Ricky', 'Chandu']

**10. Unique count from a column in data frame**

In [17]:
data_df['name'].nunique()

3

In [18]:
data_df['city'].nunique()

1

**11. How to add index column to the data frame:** There is no index column in the data frame. Some times you may need index value while performing operations on Data frame. Below is the way to add index column

In [19]:
# before adding index column
print(data_df)

     name  age       city
0  Chandu   40  Singapore
1   Richy    7  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore

In [20]:
#After adding index column
data_df['index1'] = data_df.index
print(data_df)

     name  age       city  index1
0  Chandu   40  Singapore       0
1   Richy    7  Singapore       1
2  Chandu   40  Singapore       2
3   Ricky   10  Singapore       3

**12. Delete a column from data frame**

In [21]:
#Before deleting index1
print(data_df)

     name  age       city  index1
0  Chandu   40  Singapore       0
1   Richy    7  Singapore       1
2  Chandu   40  Singapore       2
3   Ricky   10  Singapore       3

In [22]:
del data_df['index1']
#After deleting index1 column
print(data_df)

     name  age       city
0  Chandu   40  Singapore
1   Richy    7  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore

**13. Remove duplicate rows from data frame:**In the below example, name_city_df contains 0th and 2nd row same values.
Remove that duplicate entries by using drop_duplicates() method

In [23]:
name_city_df = pd.DataFrame(data_df, columns=['name', 'city'])

In [24]:
# with duplicate values
name_city_df

     name       city
0  Chandu  Singapore
1   Richy  Singapore
2  Chandu  Singapore
3   Ricky  Singapore

In [25]:
#After removing duplicates
name_city_df.drop_duplicates()

     name       city
0  Chandu  Singapore
1   Richy  Singapore
3   Ricky  Singapore

**14. Save data frame as a csv file:** Some times need to save df into a file for later use. Its always better to save in csv format. Below is the format to save in csv format.

In [26]:
#Saving columns with out index entries
name_city_df.to_csv("name_city.csv", columns=['name','city'], index=False)

In [27]:
#Saving columns with index entries (index column header will be empty)
name_city_df.to_csv("name_city_with_index.csv", columns=['name','city'], index=True)

**15. How to read csv file as data rame:**

In [28]:
csv_df = pd.read_csv("name_city.csv")

In [29]:
csv_df

     name       city
0  Chandu  Singapore
1   Richy  Singapore
2  Chandu  Singapore
3   Ricky  Singapore

**16. Merge two data frames**: Two data frames cane be merged using 'append' operation.

In [31]:
# data frame one
age_df.append(data_df)

     name  age       city
0  Chandu   40  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore
0  Chandu   40  Singapore
1   Richy    7  Singapore
2  Chandu   40  Singapore
3   Ricky   10  Singapore

**17. Updating Dataframe column**: Updating column value basing on some condition. It is allowed to use AND, OR or any other logical operator like using normal check in python.

In [88]:
data_df

                name  age       city     village    lastname firstname
0  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
1              Richy    7  Singapore          NA       Richy     Richy
2  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
3              Ricky   10  Singapore          NA       Ricky     Ricky

In [89]:
data_df.loc[data_df['age']==40, 'village'] = 'Bonthapadu'

In [90]:
data_df.loc[data_df['age']!=40, 'village'] = 'NA'

In [91]:
data_df

                name  age       city     village    lastname firstname
0  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
1              Richy    7  Singapore          NA       Richy     Richy
2  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
3              Ricky   10  Singapore          NA       Ricky     Ricky

**18. Splitting data frame column**: Splitting column value and making new column with last value

In [92]:
# adding last name
data_df['lastname'] = data_df['name'].str.split(" ").str.get(-1)

In [93]:
data_df

                name  age       city     village    lastname firstname
0  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
1              Richy    7  Singapore          NA       Richy     Richy
2  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
3              Ricky   10  Singapore          NA       Ricky     Ricky

In [94]:
# adding first name
data_df['firstname'] = data_df['name'].str.split(" ").str.get(0)

In [95]:
data_df

                name  age       city     village    lastname firstname
0  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
1              Richy    7  Singapore          NA       Richy     Richy
2  Chandu Pasumarthi   40  Singapore  Bonthapadu  Pasumarthi    Chandu
3              Ricky   10  Singapore          NA       Ricky     Ricky